// @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@
// @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@
// @@@@@@              @@@@@       @@@@@@@@          @@@@@      ,@@@      @@       @@@      @@@@@@@@@@@
// @@@@@@               .@@@       @@@@@@@@           @@@@       @@@      @@       @@      @@@@@@@@@@@@
// @@@@@@       @@%      @@@       @@@@@@@,     &     @@@@        @@      @@       @      .@@@@@@@@@@@@
// @@@@@@       @@.      @@@       @@@@@@@      @     ,@@@         @      @@       %      @@@@@@@@@@@@@
// @@@@@@             /@@@@@       @@@@@@@      @      @@@                @@             @@@@@@@@@@@@@@
// @@@@@@                @@@       @@@@@@.     @@      @@@                @@             /@@@@@@@@@@@@@
// @@@@@@       @@%      @@@       @@@@@@      @@@      @@      @         @@       @      @@@@@@@@@@@@@
// @@@@@@       @@%      @@@       @@@@@@               @@      @/        @@       @       @@@@@@@@@@@@
// @@@@@@       &.       @@@           @       @@@      &@      @@        @@       @@       @@@@@@@@@@@
// @@@@@@                @@@           @       @@@       @      @@@       @@       @@@      /@@@@@@@@@@
// @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@
// @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@
// @@@						        BLANKSOFTWARE DayZ Modding Team 							    @@@
// @@@						Website:			https://blanksoftware.tech							@@@
// @@@						Discord:			https://discord.gg/G9QgchMr9B						@@@
// @@@						Telegram: 			https://t.me/blanksoftware							@@@
// @@@						Telegram support:	https://t.me/blankdayz								@@@
// @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@
// @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@

/* 
Define - необходим для обозначения основному моду с какими модификациями на строительство ему придётся работать.

Доступны следующие вариации:
#define BLANK_VanillaBuilding               — Ванильная стройка (не отключать!)
#define BLANK_RaGBaseBuilding               — Rag_BaseBuilding (мастерская Steam)
#define BLANK_DPBuildings                   — Стройка DP
#define BLANK_BPCamping                     — Модульная стройка от бернаута
#define BLANK_YMWood                        — Частокол от Угля
#define BLANK_YMWoodBuilding                — Расширенная стройка от Угля
#define BLANK_BBP                           — Стройка BaseBuildingPlus (мастерская Steam), поддерживает только рейд-тайм

У тебя модификации от Тиерро?
- Радуйся! Тебе ничего не нужно делать, модификация имеет собственные дефайны, 
которые автоматически подключаются в основной мод, настройка рейд по дверям для лесного домика делается с помощью "tR_Custom.pbo".
Спасибо Тиерро!

Как убрать/включить тот или иной define?
- Перед #define ставим "//" без ковычек соответственно, 
либо же наоборот, чтобы включить убираем "//"!
*/

#define BLANK_VanillaBuilding
//#define BLANK_DPBuildings
//#define BLANK_RaGBaseBuilding
//#define BLANK_BPCamping
//#define BLANK_YMWood
//#define BLANK_YMWoodBuilding
//#define BLANK_R22RBase
//#define BLANK_BBP

// @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@
// @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@
// @@@@@@              @@@@@       @@@@@@@@          @@@@@      ,@@@      @@       @@@      @@@@@@@@@@@
// @@@@@@               .@@@       @@@@@@@@           @@@@       @@@      @@       @@      @@@@@@@@@@@@
// @@@@@@       @@%      @@@       @@@@@@@,     &     @@@@        @@      @@       @      .@@@@@@@@@@@@
// @@@@@@       @@.      @@@       @@@@@@@      @     ,@@@         @      @@       %      @@@@@@@@@@@@@
// @@@@@@             /@@@@@       @@@@@@@      @      @@@                @@             @@@@@@@@@@@@@@
// @@@@@@                @@@       @@@@@@.     @@      @@@                @@             /@@@@@@@@@@@@@
// @@@@@@       @@%      @@@       @@@@@@      @@@      @@      @         @@       @      @@@@@@@@@@@@@
// @@@@@@       @@%      @@@       @@@@@@               @@      @/        @@       @       @@@@@@@@@@@@
// @@@@@@       &.       @@@           @       @@@      &@      @@        @@       @@       @@@@@@@@@@@
// @@@@@@                @@@           @       @@@       @      @@@       @@       @@@      /@@@@@@@@@@
// @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@
// @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@
// @@@						        BLANKSOFTWARE DayZ Modding Team 							    @@@
// @@@						Website:			https://blanksoftware.tech							@@@
// @@@						Discord:			https://discord.gg/G9QgchMr9B						@@@
// @@@						Telegram: 			https://t.me/blanksoftware							@@@
// @@@						Telegram support:	https://t.me/blankdayz								@@@
// @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@
// @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@